app/Http/Helpers.php

select * from `flash_deals` where `status` = '1' and `featured` = '1' and `start_date` <= 1699216257 and `end_date` >= 1699216257 limit 1
---
    function get_featured_flash_deal()
    {
        $flash_deal_query = FlashDeal::query();
        $featured_flash_deal = $flash_deal_query->isActiveAndFeatured()
            ->where('start_date', '<=', strtotime(date('Y-m-d H:i:s')))
            ->where('end_date', '>=', strtotime(date('Y-m-d H:i:s')))
            ->first();

select * from `languages` where `code` = 'en' limit 1
---
    function get_system_language()
    {
        $language_query = Language::query();

        $locale = 'en';
        if(Session::has('locale')){
            $locale = Session::get('locale', Config::get('app.locale'));
        }

        $language_query->where('code',  $locale);

        return $language_query->first();

select * from `languages` where `status` = 1
---
    function get_all_active_language()
    {
        $language_query = Language::query();
        $language_query->where('status', 1);

        return $language_query->get();

select * from `languages` where `code` = 'en' limit 1
---
    function get_session_language()
    {
        $language_query = Language::query();
        return $language_query->where('code', Session::get('locale', Config::get('app.locale')))->first();

select * from `currencies` where `id` = '1' limit 1
---
    function get_system_currency()
    {
        $currency_query = Currency::query();
        if(Session::has('currency_code')){
            $currency_query->where('code', Session::get('currency_code'));
        }
        else{
            $currency_query = $currency_query->where('id', get_setting('system_default_currency'));
        }

        return $currency_query->first();

select * from `currencies` where `status` = 1
---
    function get_all_active_currency()
    {
        $currency_query = Currency::query();
        $currency_query->where('status', 1);

        return $currency_query->get();

select * from `categories` where `level` = 0 order by `order_level` desc
---
    function get_level_zero_categories()
    {
        $categories_query = Category::query()->with(['coverImage', 'catIcon']);
        return $categories_query->where('level', 0)->orderBy('order_level', 'desc')->get();

select * from `carts` where `user_id` = 9
---
    function get_user_cart()
    {
        $cart = [];
        if (auth()->user() != null) {
            $cart = Cart::where('user_id', Auth::user()->id)->get();

select * from `shops` where `verification_status` = 1 order by `num_of_sale` desc limit 5
---
    function get_best_sellers($limit = '')
    {
        return Cache::remember('best_selers', 86400, function () use ($limit) {
            return Shop::where('verification_status', 1)->orderBy('num_of_sale', 'desc')->take($limit)->get();