app/Http/Helpers.php

select `user_id` from `shops` where `verification_status` = 1
---
    function verified_sellers_id()
    {
        return Cache::rememberForever('verified_sellers_id', function () {
            return App\Models\Shop::where('verification_status', 1)->pluck('user_id')->toArray();
        });

select * from `currencies` where `currencies`.`id` = '1' limit 1
---
    function get_system_default_currency()
    {
        return Cache::remember('system_default_currency', 86400, function () {
            return Currency::findOrFail(get_setting('system_default_currency'));
        });

select `lang_value`, `lang_key` from `translations` where `lang` = 'en'
insert into `translations` (`lang`, `lang_key`, `lang_value`, `updated_at`, `created_at`) values ('en', 'offline_wallet_recharge_requests', 'Offline Wallet Recharge Requests', '2023-11-05 20:14:17', '2023-11-05 20:14:17')
---
function translate($key, $lang = null, $addslashes = false)
{
    if ($lang == null) {
        $lang = App::getLocale();
    }

    $lang_key = preg_replace('/[^A-Za-z0-9\_]/', '', str_replace(' ', '_', strtolower($key)));

    $translations_en = Cache::rememberForever('translations-en', function () {
        return Translation::where('lang', 'en')->pluck('lang_value', 'lang_key')->toArray();
    });

    if (!isset($translations_en[$lang_key])) {
        $translation_def = new Translation;
        $translation_def->lang = 'en';
        $translation_def->lang_key = $lang_key;
        $translation_def->lang_value = str_replace(array("\r", "\n", "\r\n"), "", $key);
        $translation_def->save();
        Cache::forget('translations-en');
    }

    // return user session lang
    $translation_locale = Cache::rememberForever("translations-{$lang}", function () use ($lang) {
        return Translation::where('lang', $lang)->pluck('lang_value', 'lang_key')->toArray();
    });
    if (isset($translation_locale[$lang_key])) {
        return $addslashes ? addslashes(trim($translation_locale[$lang_key])) : trim($translation_locale[$lang_key]);
    }

    // return default lang if session lang not found
    $translations_default = Cache::rememberForever('translations-' . env('DEFAULT_LANGUAGE', 'en'), function () {
        return Translation::where('lang', env('DEFAULT_LANGUAGE', 'en'))->pluck('lang_value', 'lang_key')->toArray();
    });

select * from `uploads` where `uploads`.`id` = 'uploads/categories/icon/KjJP9wuEZNL184XVUk3S7EiZ8NnBN99kiU4wdvp3.png' and `uploads`.`deleted_at` is null limit 1
---
    function uploaded_asset($id)
    {
        if (($asset = \App\Models\Upload::find($id)) != null) {

select * from `business_settings`
---
    function get_setting($key, $default = null, $lang = false)
    {
        $settings = Cache::remember('business_settings', 86400, function () {
            return BusinessSetting::all();
        });

select * from `addons`
---
    function addon_is_activated($identifier, $default = null)
    {
        $addons = Cache::remember('addons', 86400, function () {
            return Addon::all();
        });

select * from `languages` where `code` = 'en' limit 1
---
    function get_system_language()
    {
        $language_query = Language::query();

        $locale = 'en';
        if(Session::has('locale')){
            $locale = Session::get('locale', Config::get('app.locale'));
        }

        $language_query->where('code',  $locale);

        return $language_query->first();

select * from `languages` where `status` = 1
---
    function get_all_active_language()
    {
        $language_query = Language::query();
        $language_query->where('status', 1);

        return $language_query->get();

select * from `languages` where `code` = 'en' limit 1
---
    function get_session_language()
    {
        $language_query = Language::query();
        return $language_query->where('code', Session::get('locale', Config::get('app.locale')))->first();

select * from `currencies` where `id` = '1' limit 1
---
    function get_system_currency()
    {
        $currency_query = Currency::query();
        if(Session::has('currency_code')){
            $currency_query->where('code', Session::get('currency_code'));
        }
        else{
            $currency_query = $currency_query->where('id', get_setting('system_default_currency'));
        }

        return $currency_query->first();

select * from `currencies` where `status` = 1
---
    function get_all_active_currency()
    {
        $currency_query = Currency::query();
        $currency_query->where('status', 1);

        return $currency_query->get();

select * from `categories` where `level` = 0 order by `order_level` desc
---
    function get_level_zero_categories()
    {
        $categories_query = Category::query();
        return $categories_query->where('level', 0)->orderBy('order_level', 'desc')->get();

select * from `carts` where `user_id` = 9
---
    function get_user_cart()
    {
        $cart = null;
        if (auth()->user() != null) {
            $cart = Cart::where('user_id', Auth::user()->id)->get();

select * from `shops` where `verification_status` = 1 order by `num_of_sale` desc limit 5
---
    function get_best_sellers($limit = '')
    {
        return Cache::remember('best_selers', 86400, function () use ($limit) {
            return Shop::where('verification_status', 1)->orderBy('num_of_sale', 'desc')->take($limit)->get();
        });