app/Http/Controllers/PosController.php

select * from `users` where `user_type` = 'customer' and `email_verified_at` is not null order by `created_at` desc
---
    public function index()
    {
        $customers = User::where('user_type', 'customer')->where('email_verified_at', '!=', null)->orderBy('created_at', 'desc')->get();